
			************************************************
			****				Stata之禅				****
			****			the Zen of Stata			****
			************************************************
			
*=============================			
*-四个参数画大象
*=============================

clear
set obs 1000         // 设置1000个观察值
gen t = _n/100       // 产生t值

/* 根据公式生成坐标(x, y) */
gen y = -50*sin(t) - 18*sin(2*t) - 12*cos(3*t) + 14*cos(5*t)
gen x = -60*cos(t) - 30*sin(t) + 8*sin(2*t) - 10*sin(3*t)

/* 设置眼睛参数 */
replace x = 20 in 1
replace y = 20 in 1

/* 画大象 */
scatter y x, 		///
	xtitle("") 		///
	ytitle("") 		///
	scheme(s1mono)
	
